In [147]:
# NumPy and Pandas Assignment
# Complete the following tasks by filling in the code where indicated.
# Ensure your notebook is well-documented with markdown cells explaining your code and result.

import numpy as np
import pandas as pd

# Task 1: NumPy Basics

### Array Creation
#### 1. Create an array of 10 zeros but set the fifth element to 1.

In [168]:
 #solution
array_zeros = np.zeros(10, dtype=int)
array_zeros[4] = 1
print(array_zeros)

[0 0 0 0 1 0 0 0 0 0]

### 2. Create a 4x4 matrix with values ranging from 0 to 15.

In [169]:
# solution
matrix = np.linspace(0, 15, 16)
matrix1 = np.reshape(matrix, (4, 4))
print(matrix1)

[[ 0.  1.  2.  3.]
 [ 4.  5.  6.  7.]
 [ 8.  9. 10. 11.]
 [12. 13. 14. 15.]]

### Array Operations

#### 3. Create two NumPy arrays: Perform element-wise addition, subtraction, multiplication, and division.
#### arr1: array([[41, 30, 10], [ 6, 35, 23], [23,  9, 10]])
#### arr2: array([[4, 29,  2], [5, 13,  3], [24, 16,  7]])

In [170]:
# solution
arr1 = np.array([[41, 30, 10], [6, 35, 23], [23, 9, 10]])
arr2 = np.array([[4, 29, 2], [5, 13, 3], [24, 16, 7]])

# addition: arr1 + arr2
addition = arr1 + arr2
# subtraction: arr1 - arr2 
subtraction = arr1 - arr2
# division: arr1 / arr2
division = arr1 / arr2
# multiplication: arr1 * arr2
multiplication = arr1 * arr2

### Array Slicing
#### 4. Given the array: 
#### arr = np.array([10, 20, 30, 40, 50, 60, 70, 80, 90, 100])
#### Extract elements from index 2 to 6.

In [171]:
# solution
arr = np.array([10, 20, 30, 40, 50, 60, 70, 80, 90, 100])
sliced_array = arr[2:7]
print(sliced_array)

[30 40 50 60 70]

### Using NumPy Methods
#### 5. Convert the array below to a 3Ã—3 NumPy array.
#### array([[15, 18, 20], [15, 30, 8], [25, 30, 60]])
#### Find the mean, sum, and maximum value.

In [152]:
# solution
input1 = np.array([[15, 18, 20], [15, 30, 8], [25, 30, 60]])
input_array = input1.reshape(3,3)

sum_value = np.sum(input_array)
max_value = np.max(input_array)

# NB: round the mean to two decimal places
mean_value = round(np.mean(input_array), 2)
mean_value

24.56

# Task 2: Pandas Basics

### Creating a Pandas Series
#### 1. Create a Pandas Series from the list [10, 20, 30, 40, 50] with index labels 'a', 'b', 'c', 'd', 'e'.

In [153]:
# solution
my_series = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])
my_series

a    10
b    20
c    30
d    40
e    50
dtype: int64

### Reading a CSV File
#### 2. Read a CSV file named "data.csv" into a Pandas DataFrame. The CSV file has the following columns: "Name", "Age", "Salary".

In [154]:
# solution
df = pd.read_csv("data/data.csv")
df

       Name  Age  Salary
0     Alice   29   73193
1       Bob   53   85398
2   Charlie   36   47162
3     David   22   65853
4       Eve   24   36168
5     Frank   58   69657
6     Grace   41   85202
7    Hannah   38   62421
8     Isaac   50   74641
9      Jack   47   38963
10    Karen   34   32136
11      Leo   49   41874
12     Mona   56   34070
13     Nina   49   91734
14    Oscar   30   89539
15     Paul   23   78720
16    Quinn   31   54424
17   Rachel   54   59900
18    Steve   36   32163
19     Tina   56   52054

### Slicing a DataFrame
#### 3. From the DataFrame created in Exercise 2, select only the first three rows.

In [155]:
first_three_rows = df.head(3)
first_three_rows

      Name  Age  Salary
0    Alice   29   73193
1      Bob   53   85398
2  Charlie   36   47162

### Manipulating a DataFrame - Adding a Column
#### 4. Add a new column named "Tax" to the DataFrame from Exercise 2. The tax should be calculated as 10% of the "Salary" column.

In [156]:
# solution
df['Tax'] = df['Salary'] * 0.1

#### Filter the dataframe by the column "age" whereby the age is above 36 years

In [157]:
# solution
filtered_df = df[df['Age'] > 36]
print(filtered_df)

      Name  Age  Salary     Tax
1      Bob   53   85398  8539.8
5    Frank   58   69657  6965.7
6    Grace   41   85202  8520.2
7   Hannah   38   62421  6242.1
8    Isaac   50   74641  7464.1
9     Jack   47   38963  3896.3
11     Leo   49   41874  4187.4
12    Mona   56   34070  3407.0
13    Nina   49   91734  9173.4
17  Rachel   54   59900  5990.0
19    Tina   56   52054  5205.4

# Task 3: Data Analysis with Pandas

### Aggregation - Compute Total and Mean Sales
#### 1. Given a dataset of sales transactions, compute the total and mean sales per region.

In [158]:
# Sample Data
sales_data = pd.DataFrame({
    "Region": ["North", "South", "North", "West", "South", "West"],
    "Sales": [1000, 1500, 1200, 1800, 1300, 1700]
})
sales_data.head()

  Region  Sales
0  North   1000
1  South   1500
2  North   1200
3   West   1800
4  South   1300

In [159]:
# solution
region_total_sales = sales_data.groupby("Region")["Sales"].sum()
region_mean_sales = sales_data.groupby("Region")["Sales"].mean()

### Merging - Combine Customer and Order Data
#### 2. Merge customers and orders data based on CustomerID.

In [160]:
customers = pd.DataFrame({
    "CustomerID": [1, 2, 3, 4],
    "CustomerName": ["Alice", "Bob", "Charlie", "David"]
})

orders = pd.DataFrame({
    "OrderID": [101, 102, 103, 104],
    "CustomerID": [1, 2, 2, 4],
    "Amount": [250, 400, 600, 150]
})

customers.head(2)
orders.head(2)

   OrderID  CustomerID  Amount
0      101           1     250
1      102           2     400

In [166]:
# solution
merged_data = pd.merge(customers, orders, on="CustomerID", how="inner")
merged_data

   CustomerID CustomerName  OrderID  Amount
0           1        Alice      101     250
1           2          Bob      102     400
2           2          Bob      103     600
3           4        David      104     150

### Joining - Left Join Employee Data
#### 4. Perform a left join between employees and departments on DeptID.

In [162]:
# NB: No test for this. Just an exercise for you to play around with
employees = pd.DataFrame({
    "EmpID": [101, 102, 103, 104],
    "EmpName": ["John", "Jane", "Alice", "Bob"],
    "DeptID": [1, 2, 2, 3]
})

departments = pd.DataFrame({
    "DeptID": [1, 2],
    "DeptName": ["HR", "Finance"]
})

employees.head(2) 
departments.head(2)

   DeptID DeptName
0       1       HR
1       2  Finance

In [167]:
# solution
left_joined_data = pd.merge(employees, departments, on="DeptID", how="left")
left_joined_data

   EmpID EmpName  DeptID DeptName
0    101    John       1       HR
1    102    Jane       2  Finance
2    103   Alice       2  Finance
3    104     Bob       3      NaN

### Pivot Table - Summarize Sales Data
#### 4. Create a pivot table showing total sales for each Region and Product.

In [164]:
sales_pivot_data = pd.DataFrame({
    "Region": ["North", "North", "South", "South", "West", "West"],
    "Product": ["A", "B", "A", "B", "A", "B"],
    "Sales": [200, 300, 150, 400, 250, 500]
})

sales_pivot_data.head(2)

  Region Product  Sales
0  North       A    200
1  North       B    300

In [165]:
# solution
pivot_table = sales_pivot_data.pivot_table(values="Sales", index="Region", columns="Product", aggfunc="sum")
pivot_table

Product    A    B
Region
North    200  300
South    150  400
West     250  500